# Module: Pandas Assignments
## Lesson: Pandas
### Assignment 1: DataFrame Creation and Indexing

1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.

In [60]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randint(1, 100, size=(6,4)), columns=['A','B','C','D']).set_index('A')
df

     B   C   D
A
64  55  56  97
55  72  53  33
53  23  43  69
54  76   9  71
4   85  17  23
61   4  23  70

2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

In [68]:
import pandas as pd
import numpy as np

df = pd.DataFrame(columns=['A','B','C'], index=['X','Y','Z'])
df = df.map(lambda x: np.random.randint(1, 100))
print("Original dataframe:")
display(df)

element = df.at['Y','B']
print(f"The element at row 'Y' and column 'B' is {element}.")

Original dataframe:

    A   B   C
X   2  98  52
Y  11  39   2
Z  21  29   5

The element at row 'Y' and column 'B' is 39.

### Assignment 2: DataFrame Operations

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.

In [71]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randint(1, 100, size=(5,3)), columns=['A','B','C'])
print("Original dataframe:")
display(df)

df['Product'] = df['A'] * df['B']
print("After addition product column:")
display(df)

Original dataframe:

    A   B   C
0  64  49  46
1   8   6   1
2  29  61  55
3  14  68  93
4  52  27  26

After addition product column:

    A   B   C  Product
0  64  49  46     3136
1   8   6   1       48
2  29  61  55     1769
3  14  68  93      952
4  52  27  26     1404

2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

In [73]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randint(1, 100, size=(4,3)), columns=['A','B','C'])
print("Original dataframe:")
display(df)

df['col-total'] = df.sum(axis=1)      # col-wise sum
df.loc['row-total'] = df.sum(axis=0)  # row-wise sum
print("Row-wise and column-wise sum:")
display(df)

Original dataframe:

    A   B   C
0  29   4  62
1  87   3  51
2  32  14  11
3  17  51  91

Row-wise and column-wise sum:

             A   B    C  col-total
0           29   4   62         95
1           87   3   51        141
2           32  14   11         57
3           17  51   91        159
row-total  165  72  215        452

### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.

In [80]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randint(1, 100, size=(5,3)), columns=['A','B','C'])
print("Original dataframe:")
display(df)

ri = lambda x,y : np.random.randint(x,y)
# Added 4 NaN values to dataframe
df.iloc[ri(0,4), ri(0,2)] = np.nan
df.iloc[ri(0,4), ri(0,2)] = np.nan
df.iloc[ri(0,4), ri(0,2)] = np.nan
df.iloc[ri(0,4), ri(0,2)] = np.nan

print("Before fill NaN:")
display(df)

df = df.fillna(round(df.mean(),1))
print("After fill NaN:")
display(df)

Original dataframe:

    A   B   C
0  92   5   5
1  19  19  33
2  59  24  91
3  38  53  36
4  22  43  71

Before fill NaN:

      A     B   C
0  92.0   5.0   5
1   NaN   NaN  33
2   NaN  24.0  91
3  38.0  53.0  36
4  22.0  43.0  71

After fill NaN:

      A     B   C
0  92.0   5.0   5
1  50.7  31.2  33
2  50.7  24.0  91
3  38.0  53.0  36
4  22.0  43.0  71

2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

In [81]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randint(1, 100, size=(5,3)), columns=['A','B','C'])
print("Original dataframe:")
display(df)

ri = lambda x,y : np.random.randint(x,y)
# Added 4 NaN values to dataframe
df.iloc[ri(0,4), ri(0,2)] = np.nan
df.iloc[ri(0,4), ri(0,2)] = np.nan
df.iloc[ri(0,4), ri(0,2)] = np.nan
df.iloc[ri(0,4), ri(0,2)] = np.nan

print("Before drop NaN:")
display(df)

df.dropna(inplace=True)
print("After drop NaN:")
df

Original dataframe:

    A   B   C
0  81  15  98
1  47  96  86
2  25  53  57
3  45  82  11
4  75  80  51

Before drop NaN:

      A     B   C
0  81.0  15.0  98
1   NaN  96.0  86
2  25.0   NaN  57
3  45.0   NaN  11
4  75.0  80.0  51

After drop NaN:

      A     B   C
0  81.0  15.0  98
4  75.0  80.0  51

### Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.

In [82]:
import pandas as pd
import numpy as np

df = pd.DataFrame(columns=['Category','Value'])
df['Category'] = [np.random.choice(['A','B','C']) for _ in range(10)]
df['Value'] = [np.random.randint(1, 10) for _ in range(10)]
print("Original dataframe:")
display(df)

print("After groupby:")
df.groupby('Category')['Value'].agg(['sum','mean'])

Original dataframe:

  Category  Value
0        B      3
1        A      3
2        C      4
3        B      4
4        B      6
5        B      1
6        B      9
7        C      6
8        C      5
9        C      5

After groupby:

          sum  mean
Category
A           3   3.0
B          23   4.6
C          20   5.0

2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

In [85]:
import pandas as pd
import numpy as np

df = pd.DataFrame(columns=['Product','Category','Sales'])

df['Category'] = np.random.choice(['A','B','C '], size=10)
df['Product'] = np.random.choice(['P1','P2','P3'], size=10)
df['Sales'] = np.random.randint(1, 10, size=10)
print("Original dataframe:")
display(df)

print("After groupby:")
df.groupby('Category')['Sales'].sum()

Original dataframe:

  Product Category  Sales
0      P1        A      8
1      P2        B      8
2      P3        A      9
3      P1        B      5
4      P1        A      7
5      P3       C       5
6      P1        A      9
7      P2        A      2
8      P1        B      9
9      P2       C       1

After groupby:

Category
A     35
B     22
C      6
Name: Sales, dtype: int64

### Assignment 5: Merging DataFrames

1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.

In [90]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'Common': np.random.choice(['A','B','C'], size=5),
                    'Val1': np.random.randint(1, 100, size = 5)})
df2 = pd.DataFrame({'Common': np.random.choice(['B','C','D'], size=5),
                    'Val2': np.random.randint(1, 100, size = 5)})
print("Dataframe 1:")
display(df1)
print("Dataframe 2:")
display(df2)

print("Merged dataframe:")
df1.merge(df2, on='Common')

Dataframe 1:

  Common  Val1
0      C    38
1      C    40
2      B    28
3      B    32
4      B    67

Dataframe 2:

  Common  Val2
0      B     2
1      B    20
2      B    77
3      C    73
4      B    69

Merged dataframe:

   Common  Val1  Val2
0       C    38    73
1       C    40    73
2       B    28     2
3       B    28    20
4       B    28    77
5       B    28    69
6       B    32     2
7       B    32    20
8       B    32    77
9       B    32    69
10      B    67     2
11      B    67    20
12      B    67    77
13      B    67    69

2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along the columns.

In [91]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'A': np.random.randint(1, 100, size = 5),
                    'B': np.random.randint(1, 100, size = 5),
                    'C': np.random.randint(1, 100, size = 5)})
df2 = pd.DataFrame({'D': np.random.randint(1, 100, size = 5),
                    'E': np.random.randint(1, 100, size = 5),
                    'F': np.random.randint(1, 100, size = 5)})

print("Dataframe 1:")
display(df1)
print("Dataframe 2:")
display(df2)

print("Concatenate along rows:")
display(pd.concat([df1, df2], axis=0))

print("Concatenate along columns:")
display(pd.concat([df1, df2], axis=1))

Dataframe 1:

    A   B   C
0  56   2   1
1  51  47  86
2  62  82  29
3  13  13  22
4  86  82  46

Dataframe 2:

    D   E   F
0   7  55  86
1  34  71  20
2  72  62  74
3  92  50  24
4  49  29  38

Concatenate along rows:

      A     B     C     D     E     F
0  56.0   2.0   1.0   NaN   NaN   NaN
1  51.0  47.0  86.0   NaN   NaN   NaN
2  62.0  82.0  29.0   NaN   NaN   NaN
3  13.0  13.0  22.0   NaN   NaN   NaN
4  86.0  82.0  46.0   NaN   NaN   NaN
0   NaN   NaN   NaN   7.0  55.0  86.0
1   NaN   NaN   NaN  34.0  71.0  20.0
2   NaN   NaN   NaN  72.0  62.0  74.0
3   NaN   NaN   NaN  92.0  50.0  24.0
4   NaN   NaN   NaN  49.0  29.0  38.0

Concatenate along columns:

    A   B   C   D   E   F
0  56   2   1   7  55  86
1  51  47  86  34  71  20
2  62  82  29  72  62  74
3  13  13  22  92  50  24
4  86  82  46  49  29  38

### Assignment 6: Time Series Analysis

1. Create a Pandas DataFrame with a datetime index and one column filled with random integers. Resample the DataFrame to compute the monthly mean of the values.

In [108]:
import pandas as pd
import numpy as np


df = pd.DataFrame(columns=['Date','Sales'])
df['Date'] = pd.date_range(start='2025-01-01', end='2025-12-31', freq='D')
df['Sales'] = np.random.randint(1, 100, size=len(df))
df.set_index('Date', inplace=True)
print("Original Dataframe:")
display(df)

monthly = df.resample('ME')['Sales'].mean() # groupby time
monthly.index = monthly.index.month_name()
monthly.index.name = 'Month'
print("Monthly mean DataFrame:")
display(monthly)

Original Dataframe:

            Sales
Date
2025-01-01     67
2025-01-02     56
2025-01-03     32
2025-01-04      9
2025-01-05     18
...           ...
2025-12-27     90
2025-12-28     73
2025-12-29     70
2025-12-30     52
2025-12-31     78

[365 rows x 1 columns]

Monthly mean DataFrame:

Month
January      44.290323
February     50.857143
March        56.935484
April        48.466667
May          50.548387
June         50.033333
July         43.935484
August       51.967742
September    55.966667
October      52.322581
November     48.766667
December     47.322581
Name: Sales, dtype: float64

2. Create a Pandas DataFrame with a datetime index ranging from '2021-01-01' to '2021-12-31' and one column filled with random integers. Compute the rolling mean with a window of 7 days.

In [ ]:
import pandas as pd
import numpy as np


df = pd.DataFrame(columns=['Date','Sales'])
df['Date'] = pd.date_range(start='2021-01-01', end='2021-12-31', freq='D')
df['Sales'] = np.random.randint(1, 100, size=len(df))
df.set_index('Date', inplace=True)
print("Original Dataframe:")
display(df)

print("Rolling mean with windows of 7 days:")
display(df['Sales'].rolling(window=7).mean()) #     data

Original Dataframe:

            Sales
Date
2021-01-01     83
2021-01-02     65
2021-01-03     41
2021-01-04     99
2021-01-05      2
...           ...
2021-12-27     81
2021-12-28     39
2021-12-29     92
2021-12-30     68
2021-12-31     78

[365 rows x 1 columns]

Rolling mean with windows of 7 days:

Date
2021-01-01          NaN
2021-01-02          NaN
2021-01-03          NaN
2021-01-04          NaN
2021-01-05          NaN
                ...
2021-12-27    44.285714
2021-12-28    42.857143
2021-12-29    47.857143
2021-12-30    52.142857
2021-12-31    60.142857
Name: Sales, Length: 365, dtype: float64

### Assignment 7: MultiIndex DataFrame

1. Create a Pandas DataFrame with a MultiIndex (hierarchical index). Perform some basic indexing and slicing operations on the MultiIndex DataFrame.

In [127]:
import pandas as pd
import numpy as np

countries = ['A', 'A', 'A', 'B', 'B', 'C','C']
cities = ['one','two','one','two','one','two','two']
indices = pd.MultiIndex.from_arrays([countries, cities], names=['Cat','SubCat'])\

df = pd.DataFrame(np.random.randint(1, 100, size=(7, 3)), index=indices, columns = ['V1','V2','V3'])
print("Original dataframe:")
display(df)

print("Basic indexing:")
display(df.loc['A'])

print("Slicing operation:")
display(df.xs(('B', 'two')))

Original dataframe:

            V1  V2  V3
Cat SubCat
A   one     47  11   5
    two     47  94  12
    one     78  25  73
B   two     10  85  57
    one     63  48  61
C   two      4  62  71
    two     21  32  48

Basic indexing:

        V1  V2  V3
SubCat
one     47  11   5
two     47  94  12
one     78  25  73

Slicing operation:

/tmp/ipykernel_141584/3416302061.py:16: PerformanceWarning: indexing past lexsort depth may impact performance.
  display(df.xs(('B', 'two')))

            V1  V2  V3
Cat SubCat
B   two     10  85  57

2. Create a Pandas DataFrame with MultiIndex consisting of 'Category' and 'SubCategory'. Fill the DataFrame with random data and compute the sum of values for each 'Category' and 'SubCategory'.

In [ ]:
a

print("Sum of values for each 'Category' and 'SubCategory'")
display(df.groupby(['Cat','SubCat']).sum())

Original dataframe:

            V1  V2  V3
Cat SubCat
A   one     10  82  45
    two     18  31  69
    one     44  58   5
B   two     37  67  27
    one     58  34  51
C   two     24  73  44
    two      3   5  63

Sum of values for each 'Category' and 'SubCategory'

            V1   V2   V3
Cat SubCat
A   one     54  140   50
    two     18   31   69
B   one     58   34   51
    two     37   67   27
C   two     27   78  107

### Assignment 8: Pivot Tables

1. Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'. Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'.

In [133]:
import pandas as pd
import numpy as np

dates = pd.date_range(start='2025-01-01', end='2025-01-31')
df = pd.DataFrame({"Date": np.random.choice(dates, size=20),
                   'Category': np.random.choice(['A','B','C','D'], size=20),
                   'Value': np.random.randint(1, 100, size=20)})
print("Original dataframe:")
display(df)

print("Pivot-table:")
display(df.pivot_table(values='Value', columns='Category', index='Date', aggfunc='sum'))

Original dataframe:

         Date Category  Value
0  2025-01-09        C     19
1  2025-01-13        D     56
2  2025-01-13        B      3
3  2025-01-19        D     13
4  2025-01-21        C     98
5  2025-01-06        B      5
6  2025-01-22        C      8
7  2025-01-30        B     68
8  2025-01-05        D     88
9  2025-01-07        D     24
10 2025-01-31        A      1
11 2025-01-25        A     97
12 2025-01-10        A      5
13 2025-01-01        A     88
14 2025-01-07        C     16
15 2025-01-30        A     84
16 2025-01-11        C     64
17 2025-01-16        A     74
18 2025-01-20        C     94
19 2025-01-16        C     44

Pivot-table:

Category       A     B     C     D
Date
2025-01-01  88.0   NaN   NaN   NaN
2025-01-05   NaN   NaN   NaN  88.0
2025-01-06   NaN   5.0   NaN   NaN
2025-01-07   NaN   NaN  16.0  24.0
2025-01-09   NaN   NaN  19.0   NaN
2025-01-10   5.0   NaN   NaN   NaN
2025-01-11   NaN   NaN  64.0   NaN
2025-01-13   NaN   3.0   NaN  56.0
2025-01-16  74.0   NaN  44.0   NaN
2025-01-19   NaN   NaN   NaN  13.0
2025-01-20   NaN   NaN  94.0   NaN
2025-01-21   NaN   NaN  98.0   NaN
2025-01-22   NaN   NaN   8.0   NaN
2025-01-25  97.0   NaN   NaN   NaN
2025-01-30  84.0  68.0   NaN   NaN
2025-01-31   1.0   NaN   NaN   NaN

2. Create a Pandas DataFrame with columns 'Year', 'Quarter', and 'Revenue'. Create a pivot table to compute the mean 'Revenue' for each 'Quarter' by 'Year'.

In [ ]:
# Random float values (pure python)
uniform(1, 100)

11.872863966849186

In [ ]:
# Only output 4 quarter date of a year
pd.date_range(start='2025-01-01', end='2025-12-31', freq='QS')

DatetimeIndex(['2025-01-01', '2025-04-01', '2025-07-01', '2025-10-01'], dtype='datetime64[us]', freq='QS-JAN')

In [21]:
import pandas as pd
from random import randint, choice, uniform

dates = pd.date_range(start='2022-01-01', end='2025-12-31')
revenue = [round(uniform(1, 100),2) for _ in range(len(dates))]
df = pd.DataFrame({'Date': dates,
                   'Revenue': revenue})
df['Year'] = df['Date'].dt.year
df['Quarter'] = df['Date'].dt.quarter
df.replace({1:'Q1', 2:'Q2',3:'Q3',4:'Q4'}, inplace=True)
display(df)

df.pivot_table(index='Year', columns='Quarter', values='Revenue', aggfunc='mean')

           Date  Revenue  Year Quarter
0    2022-01-01    13.23  2022      Q1
1    2022-01-02    50.73  2022      Q1
2    2022-01-03    44.67  2022      Q1
3    2022-01-04    16.18  2022      Q1
4    2022-01-05    72.13  2022      Q1
...         ...      ...   ...     ...
1456 2025-12-27    18.66  2025      Q4
1457 2025-12-28     3.55  2025      Q4
1458 2025-12-29    62.70  2025      Q4
1459 2025-12-30    69.29  2025      Q4
1460 2025-12-31    32.03  2025      Q4

[1461 rows x 4 columns]

Quarter         Q1         Q2         Q3         Q4
Year
2022     44.060444  54.730000  50.257935  54.493804
2023     45.053111  52.253077  48.316848  49.970870
2024     49.667033  47.015604  47.334674  47.360761
2025     52.433444  49.083516  54.359239  56.988152

In [137]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'Year': np.random.choice(['2022','2023','2024','2025'], size=20),
                   'Quarter': np.random.choice(['Q1','Q2','Q3','Q4'], size=20),
                   'Revenue': np.random.randint(1, 100, size=20)})
print("Original dataframe:")
display(df)

print("Pivot table:")
display(df.pivot_table(index='Year', columns='Quarter', values='Revenue', aggfunc='mean'))

Original dataframe:

    Year Quarter  Revenue
0   2025      Q4       47
1   2024      Q4       99
2   2024      Q2       46
3   2024      Q4       89
4   2024      Q3       89
5   2025      Q3       91
6   2023      Q1       11
7   2023      Q4       41
8   2024      Q4       63
9   2024      Q4       46
10  2024      Q3       72
11  2025      Q2       21
12  2025      Q3       69
13  2024      Q1       27
14  2024      Q2       16
15  2022      Q3       69
16  2024      Q1       53
17  2024      Q1       37
18  2024      Q1       59
19  2025      Q3       38

Pivot table:

Quarter    Q1    Q2    Q3     Q4
Year
2022      NaN   NaN  69.0    NaN
2023     11.0   NaN   NaN  41.00
2024     44.0  31.0  80.5  74.25
2025      NaN  21.0  66.0  47.00

### Assignment 9: Applying Functions

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that doubles the values of the DataFrame.

In [140]:
import pandas as pd
from random import randint

df = pd.DataFrame(np.random.randint(1, 100, size=(5, 3)), columns=['A','B','C'])
print("Before apply funciton:")
display(df)
df = df.apply(lambda x: x*2)
print("After apply function:")
display(df)

Before apply funciton:

    A   B   C
0   3  80  59
1   1  19  32
2  41  64   4
3  21  73  10
4  90   4  17

After apply function:

     A    B    C
0    6  160  118
1    2   38   64
2   82  128    8
3   42  146   20
4  180    8   34

2. Create a Pandas DataFrame with 3 columns and 6 rows filled with random integers. Apply a lambda function to create a new column that is the sum of the existing columns.

In [141]:
import pandas as pd
from random import randint

df = pd.DataFrame(np.random.randint(1, 100, size=(5, 3)), columns=['A','B','C'])
print("Before apply funciton:")
display(df)
df['sum'] = df.apply(lambda x: x.sum(), axis=1)
print("After apply function:")
display(df)

Before apply funciton:

    A   B   C
0  81  78  43
1   8  67  33
2  79  50  82
3  54  74  77
4   4  45  29

After apply function:

    A   B   C  sum
0  81  78  43  202
1   8  67  33  108
2  79  50  82  211
3  54  74  77  205
4   4  45  29   78

### Assignment 10: Working with Text Data

1. Create a Pandas Series with 5 random text strings. Convert all the strings to uppercase.

In [40]:
import string
string.ascii_letters

'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'

In [44]:
from random import choices

choices(string.ascii_letters, k=6)

['s', 'I', 'Y', 'w', 'O', 's']

In [53]:
import pandas as pd
from random import choices
import string

def random_text():
    return ''.join(choices(string.ascii_letters, k=6))

pdSeries = pd.Series([random_text() for _ in range(5)])
display(pdSeries)
display(pdSeries.str.upper())

0    oIdObY
1    Xmuqhm
2    rxLOMM
3    LWsIBS
4    vpqTtN
dtype: str

0    OIDOBY
1    XMUQHM
2    RXLOMM
3    LWSIBS
4    VPQTTN
dtype: str

2. Create a Pandas Series with 5 random text strings. Extract the first three characters of each string.

In [142]:
import pandas as pd
from random import choices
import string

def random_text():
    return ''.join(choices(string.ascii_letters, k=6))

pdSeries = pd.Series([random_text() for _ in range(5)])
display(pdSeries)
# pdSeries.apply(lambda x: x[:3])
pdSeries.str[:3]

0    RrLwBF
1    EHRsLV
2    HEDvWd
3    SRhsfy
4    vcjwoS
dtype: str

0    RrL
1    EHR
2    HED
3    SRh
4    vcj
dtype: str